# SetDLComponentUseFillClassAttr

## Description
Sets the use fill class attributes flag of the component at index in the Double Line Preferences.

```pascal
FUNCTION SetDLComponentUseFillClassAttr(
				index        : INTEGER;
				useClassAttr : BOOLEAN): BOOLEAN;
```

```python
def vs.SetDLComponentUseFillClassAttr(index, useClassAttr):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component.|
|useClassAttr|BOOLEAN|Whether or not the component will use class attributes for its fill.|

## Remarks
CJG 3-23-07

## Examples
```pascal
resultOK := SetDLComponentUseFillClassAttr(1, TRUE);
```
```python
import vs

# Sets the use fill class attributes flag of the component at index in the
# Double Line Preferences.
index = 1
useClassAttr = True

ok = vs.SetDLComponentUseFillClassAttr(index, useClassAttr)
if ok:
    vs.Message('SetDLComponentUseFillClassAttr succeeded')
else:
    vs.Message('SetDLComponentUseFillClassAttr failed')
```

## See Also
VS Functions:
GetDLComponentUseFillClassAttr

## Version
Availability: from VectorWorks13.0

## Category
* Document Settings